#include <stdio.h>

int main() {
    int N = 0;
    int accumulator = 1;
    int i = 0;

    printf("Введите число N: ");

    int canary = (scanf("%d", &N) == 1);
    
    printf("%s", canary ? "" : "Ошибка ввода \n");
    
    canary *= (N >= 2);
    printf("%s", canary ? "" : "Для вычисления A(N, 2) число N должно быть >= 2 \n");

    accumulator *= canary;

    while (i < canary * 2) {
        accumulator *= (N - i);
        i++;
    }

    printf("Число размещений A(%d, 2) = %d\n", N, accumulator);

    return 0;
}

/* += (сумма): Аккумулятор начинается с 0, берем то, что уже накопили, и прибавляем новое слагаемое

   *= (произведение): Аккумулятор начинается с 1 (нейтральный элемент умножения)
   берем текущий результат и умножаем на новый множитель (prod = prod * x)
   если бы начали с 0, всё произведение обнулилось бы                                               */