#include <stdio.h>

int main() {
    int N;
    
    printf("Вычисление числа размещений A(N, 2) = N * (N - 1)\n");
    printf("Введите N: ");

    while (scanf("%d", &N) == 1) {

        int accumulator = 1;
        int i = 0;

        while (i < 2) {

            accumulator *= (N - i); 
            i++;
        }

        printf("Для N = %d: A(N, 2) = %d\n", N, accumulator);
    }

    printf("Программа завершена.\n");
    return 0;
}

/* += (сумма): Аккумулятор начинается с 0, берем то, что уже накопили, и прибавляем новое слагаемое

   *= (произведение): Аккумулятор начинается с 1 (нейтральный элемент умножения)
   берем текущий результат и умножаем на новый множитель (prod = prod * x)
   если бы начали с 0, всё произведение обнулилось бы                                               */