#include <stdio.h>

int main() {
    int N;
    int accumulator = 1;
    int i = 0;

    printf("Введите число N: ");

    scanf("%d", &N);

    while (i < 2) {
        accumulator *= (N - i);
        i++;
    }
    printf("Число размещений A(%d, 2) = %d\n", N, accumulator);

    return 0;
}

/* += (сумма): Аккумулятор начинается с 0, берем то, что уже накопили, и прибавляем новое слагаемое

   *= (произведение): Аккумулятор начинается с 1 (нейтральный элемент умножения)
   берем текущий результат и умножаем на новый множитель (prod = prod * x)
   если бы начали с 0, всё произведение обнулилось бы                                               */